jobs/20260720-163038-luqia-vllm-smoke-5min-neptune-lgc990/slurm-249396.out

===== job_info =====
time=2026-07-20T16:32:25+02:00
hostname=neptune
whoami=chjing
HOME=/data/users/chjing
SLURM_JOB_ID=249396
SLURM_JOB_NODELIST=neptune
SLURM_JOB_GPUS=0
CUDA_VISIBLE_DEVICES_initial=0
allocated_gpu_id=0
python_bin=/data/users/chjing/miniforge3/envs/cuda-env/bin/python
vllm_bin=/data/users/chjing/miniforge3/envs/cuda-env/bin/vllm
target_sm_mhz=990
bench_duration_s=300
output_dir=/data/users/chjing/Sweep_LLM_Jobs_broker/jobs/20260720-163038-luqia-vllm-smoke-5min-neptune-lgc990/vllm_smoke_results
vllm_version=0.15.1
torch_version=2.9.1+cu128
cuda_available=True
index, name, memory.total [MiB], driver_version
0, NVIDIA L40S, 46068 MiB, 595.71.05

===== baseline_before_locked_clock =====
timestamp, index, name, clocks.current.graphics [MHz], clocks.current.sm [MHz], clocks.current.memory [MHz], clocks.max.graphics [MHz], power.draw [W], utilization.gpu [%], memory.used [MiB], temperature.gpu
2026/07/20 16:32:33.047, 0, NVIDIA L40S, 210 MHz, 210 MHz, 405 MHz, 2520 MHz, 30.87 W, 0 %, 0 MiB, 22
monitor_pid=403996

===== set_locked_gpu_clock =====
allocated_gpu_id=0
pre_reset_command=sudo nvidia-smi -i 0 -rgc
All done.
set_command=sudo nvidia-smi -i 0 -lgc 990,990
GPU clocks set to "(gpuClkMin 990, gpuClkMax 990)" for GPU 00000000:4A:00.0

Warning: persistence mode is disabled on device 00000000:4A:00.0. See the Known Issues section of the nvidia-smi(1) man page for more information. Run with [--help | -h] switch to get more information on how to enable persistence mode.
All done.
set_frequency_rc=0

===== after_locked_clock_change =====
timestamp, index, name, clocks.current.graphics [MHz], clocks.current.sm [MHz], clocks.current.memory [MHz], clocks.max.graphics [MHz], power.draw [W], utilization.gpu [%], memory.used [MiB], temperature.gpu
2026/07/20 16:32:38.401, 0, NVIDIA L40S, 990 MHz, 990 MHz, 9001 MHz, 2520 MHz, 60.01 W, 0 %, 0 MiB, 23

===== start_vllm_server =====
CUDA_VISIBLE_DEVICES=0
model=mistralai/Mistral-7B-v0.1
port=28396
server_pid=404046
waiting_for_server_s=5
waiting_for_server_s=10
waiting_for_server_s=15
waiting_for_server_s=20
waiting_for_server_s=25
waiting_for_server_s=30
waiting_for_server_s=35
waiting_for_server_s=40
waiting_for_server_s=45
waiting_for_server_s=50
waiting_for_server_s=55
waiting_for_server_s=60
server_ready=true
server_ready_after_s=60
{"object":"list","data":[{"id":"mistralai/Mistral-7B-v0.1","object":"model","created":1784558018,"owned_by":"vllm","root":"mistralai/Mistral-7B-v0.1","parent":null,"max_model_len":4096,"permission":[{"id":"modelperm-8ae64059939db882","object":"model_permission","created":1784558018,"allow_create_engine":false,"allow_sampling":true,"allow_logprobs":true,"allow_search_indices":false,"allow_view":true,"allow_fine_tuning":false,"organization":"*","group":null,"is_blocking":false}]}]}
===== vllm_bench_5min =====
bench_start=2026-07-20T16:33:38+02:00
bench_iter=1 remaining_s=300 start=2026-07-20T16:33:38+02:00
bench_iter=1 rc=0 end=2026-07-20T16:35:03+02:00
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x78bb1e085000>, seed=0, num_prompts=120, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://localhost:28396', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=64, model='mistralai/Mistral-7B-v0.1', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=2.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=5, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-32092fbf-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 07-20 16:33:55 [datasets.py:612] Sampling input_len from [1023, 1023] and output_len from [128, 128]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 5 requests...
100%|██████████| 5/5 [00:03<00:00,  1.42it/s]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 2.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
100%|██████████| 120/120 [01:03<00:00,  1.90it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     120       
Failed requests:                         0         
Maximum request concurrency:             64        
Request rate configured (RPS):           2.00      
Benchmark duration (s):                  63.20     
Total input tokens:                      122760    
Total generated tokens:                  15360     
Request throughput (req/s):              1.90      
Output token throughput (tok/s):         243.03    
Peak output token throughput (tok/s):    481.00    
Peak concurrent requests:                24.00     
Total token throughput (tok/s):          2185.33   
---------------Time to First Token----------------
Mean TTFT (ms):                          261.88    
Median TTFT (ms):                        225.55    
P99 TTFT (ms):                           509.89    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          37.40     
Median TPOT (ms):                        36.61     
P99 TPOT (ms):                           50.34     
---------------Inter-token Latency----------------
Mean ITL (ms):                           37.40     
Median ITL (ms):                         27.72     
P99 ITL (ms):                            164.58    
==================================================
bench_iter=2 remaining_s=215 start=2026-07-20T16:35:03+02:00